import matplotlib.pyplot as plt
import numpy as np
import matplotlib

# 设置全局字体为 Times New Roman
matplotlib.rcParams['font.family'] = 'Times New Roman'
matplotlib.rcParams['font.size'] = 16  # 同时设置字体大小

# 定义用户数量
users = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

utility_com =[-0.09427757499529399, 0.44857995854207644, 0.9447767970100251, 1.3476304982139808, 2.151471900597091, 2.5117978376055916, 2.8374763833409204, 3.128519455357214, 4.137588754640703, 4.841118612267479]

utility_pgirdfl =[-1.3877787807814457e-17, -0.006797242984193468, -0.002813598663342208, -0.005760126285336323, -0.0052901349992183645, -0.0068163565077450534, -0.0015263592286815994, -0.004822200008793588, -0.004216541814133744, -0.0041654194594953195]

utility_fixed =[-0.11951089453407726, -0.15582417286707484, -0.20845469475400458, -0.17102570082538038, -0.16327664270577924, -0.1965706267895485, -0.1732580930790668, -0.1737855234231951, -0.16176716658250978, -0.16226824717200872]

utility_random =[-0.00775772965676802, -0.1276995593023431, -0.014748388855893801, -0.04018337184850951, 0.03171486799041345, -0.07376649190550988, 0.01852359318010266, 0.010515068794122756, 0.04579596797720353, -0.10655516258106379]

# 绘制图表
plt.plot(users, utility_com, 'r--o', label='Comparison')  # 红色虚线，圆形标记
plt.plot(users, utility_pgirdfl, 'b--s', label='PGI-RDFL')  # 蓝色虚线，方形标记
plt.plot(users, utility_fixed, 'y--o', label='Fixed')
plt.plot(users, utility_random, 'g--^', label='Random')  # 绿色虚线，三角形标记

# 添加图例
plt.legend()

plt.tick_params(axis='x', labelsize=14)
plt.tick_params(axis='y', labelsize=14)

# 设置标题和坐标轴标签
plt.xlabel(r'$N$')
plt.ylabel(r'$U_s$')

# 强制显示完全
plt.tight_layout()

# 显示网格
plt.grid(True)

# 显示图表
plt.show()